In [1]:
import pandas as pd
import numpy as np

In [2]:
df_s = pd.DataFrame(dict(col1 = [100,200,300],
                        col2 = [10,20,30],
                        shape=['A','B','C']))
df_s

   col1  col2 shape
0   100    10     A
1   200    20     B
2   300    30     C

In [3]:
df_s.col1

0    100
1    200
2    300
Name: col1, dtype: int64

In [4]:
df_s.shape

(3, 3)

In [5]:
df_s['shape']

0    A
1    B
2    C
Name: shape, dtype: object

In [6]:
df_s.iloc[:2,]

   col1  col2 shape
0   100    10     A
1   200    20     B

In [7]:
df_s.loc[:2,]

   col1  col2 shape
0   100    10     A
1   200    20     B
2   300    30     C

In [8]:
df = pd.read_csv("krx_202105_utf8.csv")
df.head()

,지수명,종가,대비,등락률,시가,고가,저가,거래량,거래대금,상장시가총액,날짜
0,KRX 300,1901.05,-11.63,-0.61,1913.15,1929.94,1896.65,279548840,13488481375036,2028800954161500,20210503
1,KTOP 30,11520.28,-86.30,-0.74,11609.44,11702.14,11490.84,50048566,5645660149606,1208343758559140,20210503
2,KRX 100,6624.66,-29.51,-0.44,6656.43,6722.06,6607.57,125958178,9134221260606,1698357633429640,20210503
3,KRX Mid 200,1807.31,-38.30,-2.08,1844.35,1855.67,1805.75,192901461,2205453931448,97954895348159,20210503
4,KRX 자동차,2264.05,46.91,2.12,2218.81,2316.00,2218.81,12130931,907051604153,132659985792225,20210503

In [9]:
df_sub = df.loc[df['지수명'] == "KRX 300"]

In [10]:
df_sub.head(2)

,지수명,종가,대비,등락률,시가,고가,저가,거래량,거래대금,상장시가총액,날짜
0,KRX 300,1901.05,-11.63,-0.61,1913.15,1929.94,1896.65,279548840,13488481375036,2028800954161500,20210503
29,KRX 300,1916.40,15.35,0.81,1903.57,1916.40,1892.36,244040965,11708937073166,2043945386926060,20210504

In [11]:
df["지수명"].unique()

array(['KRX 300', 'KTOP 30', 'KRX 100', 'KRX Mid 200', 'KRX 자동차',
       'KRX 반도체', 'KRX 헬스케어', 'KRX 은행', 'KRX 에너지화학', 'KRX 철강', 'KRX 방송통신',
       'KRX 건설', 'KRX 증권', 'KRX 기계장비', 'KRX 보험', 'KRX 운송', 'KRX 경기소비재',
       'KRX 필수소비재', 'KRX 미디어&엔터테인먼트', 'KRX 정보기술', 'KRX 유틸리티',
       'KRX 300 정보기술', 'KRX 300 금융', 'KRX 300 자유소비재', 'KRX 300 산업재',
       'KRX 300 헬스케어', 'KRX 300 커뮤니케이션서비스', 'KRX 300 소재', 'KRX 300 필수소비재'],
      dtype=object)

In [12]:
df.loc[df['종가'].idxmax(),['지수명','종가','날짜']]

지수명     KTOP 30
종가     11869.29
날짜     20210510
Name: 117, dtype: object

In [13]:
df.loc[df['종가']==df['종가'].min(),['지수명','종가','날짜']]

          지수명      종가        날짜
361  KRX 기계장비  591.32  20210521

In [14]:
## 기출예제 결측치가 있는 경우 결측치의 앞과 뒤 숫자 하나를 사용하여 평균을 산출하고 해당 값으로 결측치를 대치

In [15]:
ser_na = pd.Series([2,4,np.nan,8,9])
ser_na

0    2.0
1    4.0
2    NaN
3    8.0
4    9.0
dtype: float64

In [16]:
ser_na.interpolate()

0    2.0
1    4.0
2    6.0
3    8.0
4    9.0
dtype: float64

In [36]:
df_serna = pd.DataFrame(ser_na)
df_serna.head()

     0
0  2.0
1  4.0
2  NaN
3  8.0
4  9.0

In [47]:
df_serna = df_serna.shift(-1)

In [50]:
df_serna

     0
0  4.0
1  NaN
2  8.0
3  9.0
4  NaN

In [48]:
np.where(df_serna.isna(), 11.0, df_serna)

array([[ 4.],
       [11.],
       [ 8.],
       [ 9.],
       [11.]])

In [57]:
df_serna.isna()

       0
0  False
1   True
2  False
3  False
4   True

In [49]:
df_serna

     0
0  4.0
1  NaN
2  8.0
3  9.0
4  NaN

In [17]:
df= pd.read_csv('iris_missing.csv')
df.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [18]:
df_sub =df.head()
df_sub.info()

AttributeError: 'function' object has no attribute 'info'

In [19]:
df_sub.count()

Sepal.Length    5
Sepal.Width     4
Petal.Length    4
Petal.Width     5
Species         5
dtype: int64

In [21]:
df_sub.isna().sum()

Sepal.Length    0
Sepal.Width     1
Petal.Length    1
Petal.Width     0
Species         0
dtype: int64

In [59]:
df_bike = pd.read_csv('bike.csv')
df_bike.head()

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,27,32
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0,3,10,13
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0,0,1,1

In [61]:
df_bike['season'].unique()

array([1, 2, 3, 4])

In [62]:
df_bike['season'].nunique()

4

In [63]:
df_bike['season'].value_counts()

4    2734
2    2733
3    2733
1    2686
Name: season, dtype: int64

In [64]:
df_bike['season'].value_counts(normalize=True)

4    0.251148
2    0.251056
3    0.251056
1    0.246739
Name: season, dtype: float64

In [65]:
pd.crosstab(df_bike['season'], df_bike['holiday'])

holiday     0   1
season
1        2615  71
2        2685  48
3        2637  96
4        2638  96

In [66]:
pd.crosstab(df_bike['season'], df_bike['holiday'], normalize = True)

holiday         0         1
season
1        0.240217  0.006522
2        0.246647  0.004409
3        0.242238  0.008819
4        0.242330  0.008819

In [68]:
sum((df_bike['season']==1) & (df_bike['holiday'] == 1))

71

In [69]:
pd.crosstab(df_bike['season'], df_bike['holiday'], normalize = index)

NameError: name 'index' is not defined

In [70]:
pd.crosstab(df_bike['season'], df_bike['holiday'], values = df_bike['count'], aggfunc='mean')

holiday           0           1
season
1        117.494837   73.929577
2        215.562756  197.833333
3        234.293136  237.822917
4        198.560273  210.750000

In [74]:
df_bike.groupby(['season','holiday'])['count'].mean()

season  holiday
1       0          117.494837
        1           73.929577
2       0          215.562756
        1          197.833333
3       0          234.293136
        1          237.822917
4       0          198.560273
        1          210.750000
Name: count, dtype: float64

In [75]:
df_dia = pd.read_csv('diamonds.csv')
df_dia.head()

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2   0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3   0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4   0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75

In [76]:
df_dia.groupby('cut')['price'].agg(['min', 'max'])

           min    max
cut
Fair       337  18574
Good       327  18788
Ideal      326  18806
Premium    326  18823
Very Good  336  18818

In [78]:
df_dia.groupby('cut')[['price','carat']].agg({'price':'mean',
                                             'carat':'max'})

                 price  carat
cut
Fair       4358.757764   5.01
Good       3928.864452   3.01
Ideal      3457.541970   3.50
Premium    4584.257704   4.01
Very Good  3981.759891   4.00

In [81]:
df_s = pd.DataFrame(dict(col1=[100,200,300],
                        tx1=['aaa','bbb','ccc'],
                        tx2=[123,'123456','010-8923-8348']))
df_s

   col1  tx1            tx2
0   100  aaa            123
1   200  bbb         123456
2   300  ccc  010-8923-8348

In [86]:
#df_s['tx1'].replace('a','@')
#df_s['tx1'].replace('aaa','@')

df_s['tx1'].str.replace('a','@')
#df_s['tx1'].str.replace('aaa','@')

0    @@@
1    bbb
2    ccc
Name: tx1, dtype: object

In [87]:
df_s['col1'].replace({100:'A',300:'C'})

0      A
1    200
2      C
Name: col1, dtype: object

In [88]:
df_s['tx1'].str.contains('a')

0     True
1    False
2    False
Name: tx1, dtype: bool

In [89]:
df_s['tx1'].str.contains('a') +1

0    2
1    1
2    1
Name: tx1, dtype: int64

In [90]:
df_s['tx1'].str.contains('a').sum()

1

In [91]:
df_s.loc[df_s['tx1'].str.contains('a'),]

   col1  tx1  tx2
0   100  aaa  123

In [92]:
df_s.loc[df_s['tx1'].str.contains("^[^a]+?$"),]

   col1  tx1            tx2
1   200  bbb         123456
2   300  ccc  010-8923-8348

In [94]:
df_s.loc[~df_s['tx1'].str.contains('a'),]

   col1  tx1            tx2
1   200  bbb         123456
2   300  ccc  010-8923-8348

In [95]:
df_s['tx2'].str.split('-')

0                  NaN
1             [123456]
2    [010, 8923, 8348]
Name: tx2, dtype: object

In [96]:
df_s['tx2'].astype('str').str.split('-')

0                [123]
1             [123456]
2    [010, 8923, 8348]
Name: tx2, dtype: object

In [97]:
df_s['tx2'].astype('str').str.split('-').explode()

0       123
1    123456
2       010
2      8923
2      8348
Name: tx2, dtype: object

In [101]:
df_s['tx2'].astype('str').str.split('-',expand=True).fillna("")

        0     1     2
0     123
1  123456
2     010  8923  8348

In [102]:
df_s['tx2'].astype('str').str.split('-',expand=True).add_prefix('tx2_') #pandas 2.0.0 부터 사용 가능

    tx2_0 tx2_1 tx2_2
0     123  None  None
1  123456  None  None
2     010  8923  8348

In [103]:
df_o = pd.DataFrame(dict(cat=['good','very good','bad']))
df_o_dum = pd.get_dummies(df_o,columns=['cat'])
df_o_dum

   cat_bad  cat_good  cat_very good
0        0         1              0
1        0         0              1
2        1         0              0

In [104]:
df_o

         cat
0       good
1  very good
2        bad

In [105]:
df_o_dum.columns = df_o_dum.columns.str.replace(" ","_")
df_o_dum

   cat_bad  cat_good  cat_very_good
0        0         1              0
1        0         0              1
2        1         0              0

In [108]:
ser_t1 = pd.Series(['2023-04-21'])
ser_t2 = pd.Series(['2023년 3월 21일'])
ser_t3 = pd.Series([123455])

In [109]:
pd.to_datetime(ser_t1)

0   2023-04-21
dtype: datetime64[ns]

In [110]:
pd.to_datetime(ser_t2)

ParserError: Unknown string format: 2023년 3월 21일

In [111]:
pd.to_datetime(ser_t2, format='%Y년 %m월 %d일')

0   2023-03-21
dtype: datetime64[ns]

In [112]:
pd.to_datetime(ser_t3)

0   1970-01-01 00:00:00.000123455
dtype: datetime64[ns]

In [115]:
pd.to_datetime(ser_t3,origin='2023-08-02')

0   2023-08-02 00:00:00.000123455
dtype: datetime64[ns]

In [114]:
pd.to_datetime(ser_t3,origin='2023-08-02', unit='ms')

0   2023-08-02 00:02:03.455
dtype: datetime64[ns]

In [136]:
df_b = pd.read_csv('bike.csv')
df_b = df_b.iloc[2:6,[0]]
df_b

              datetime
2  2011-01-01 02:00:00
3  2011-01-01 03:00:00
4  2011-01-01 04:00:00
5  2011-01-01 05:00:00

In [137]:
df_b.loc[0, 'datetime'] = '2023-08-01 02:00:00'
df_b.loc[1,'datetime'] = '2023-08-02 02:00:00'

In [138]:
df_b['datetime'] = pd.to_datetime(df_b['datetime'])

In [139]:
df_b

             datetime
2 2011-01-01 02:00:00
3 2011-01-01 03:00:00
4 2011-01-01 04:00:00
5 2011-01-01 05:00:00
0 2023-08-01 02:00:00
1 2023-08-02 02:00:00

In [140]:
df_b['date'] = df_b['datetime'].dt.date
df_b['year'] = df_b['datetime'].dt.year
df_b['month'] = df_b['datetime'].dt.month
df_b['hour'] = df_b['datetime'].dt.hour
df_b['wday'] = df_b['datetime'].dt.weekday
df_b['is_wend'] = (df_b['wday'] >=5) + 0
df_b['dt_format'] = df_b['datetime'].dt.strftime('%y-%m')
df_b['datetime_s'] = df_b['datetime'] + pd.to_timedelta(9,unit='hour')

In [141]:
df_b

,datetime,date,year,month,hour,wday,is_wend,dt_format,datetime_s
2,2011-01-01 02:00:00,2011-01-01,2011,1,2,5,1,11-01,2011-01-01 11:00:00
3,2011-01-01 03:00:00,2011-01-01,2011,1,3,5,1,11-01,2011-01-01 12:00:00
4,2011-01-01 04:00:00,2011-01-01,2011,1,4,5,1,11-01,2011-01-01 13:00:00
5,2011-01-01 05:00:00,2011-01-01,2011,1,5,5,1,11-01,2011-01-01 14:00:00
0,2023-08-01 02:00:00,2023-08-01,2023,8,2,1,0,23-08,2023-08-01 11:00:00
1,2023-08-02 02:00:00,2023-08-02,2023,8,2,2,0,23-08,2023-08-02 11:00:00

In [143]:
df_e = pd.read_csv('elec_load_2017_7d.csv')
df_e.head()

,YEAR,MONTH,DAY,X1HR,X2HR,X3HR,X4HR,X5HR,X6HR,X7HR,...,X15HR,X16HR,X17HR,X18HR,X19HR,X20HR,X21HR,X22HR,X23HR,X24HR
0,2017,1,1,60178,57862,56165,55135,54450,54401,54147,...,49213,49357,50362,53115,55205,55437,55348,55790,58195,59330
1,2017,1,2,57067,55148,53983,53571,54027,55388,57753,...,72228,71945,72641,73387,72294,69989,67893,66504,67435,69275
2,2017,1,3,66263,64233,63194,62461,62649,63396,65098,...,75576,75168,75791,75922,75469,73118,70769,68726,69593,71346
3,2017,1,4,68403,66143,65051,64245,64152,64678,66494,...,74977,74275,74909,75344,74504,71957,69715,68155,68948,70834
4,2017,1,5,68053,65801,64439,63437,63135,63250,63658,...,64767,63613,63095,63230,64253,63353,62455,62314,64350,66687

In [144]:
df_e_melt = df_e.melt(id_vars = ['YEAR','MONTH','DAY'])
df_e_melt.head()

   YEAR  MONTH  DAY variable  value
0  2017      1    1     X1HR  60178
1  2017      1    2     X1HR  57067
2  2017      1    3     X1HR  66263
3  2017      1    4     X1HR  68403
4  2017      1    5     X1HR  68053

In [145]:
df_e_melt = df_e.melt(id_vars = df_e.columns[:3])
df_e_melt.head()

   YEAR  MONTH  DAY variable  value
0  2017      1    1     X1HR  60178
1  2017      1    2     X1HR  57067
2  2017      1    3     X1HR  66263
3  2017      1    4     X1HR  68403
4  2017      1    5     X1HR  68053

In [146]:
df_e_melt= df_e.melt(id_vars = df_e.columns[:3],
                    var_name = 'HOUR', value_name = 'LOAD')
df_e_melt.head()

   YEAR  MONTH  DAY  HOUR   LOAD
0  2017      1    1  X1HR  60178
1  2017      1    2  X1HR  57067
2  2017      1    3  X1HR  66263
3  2017      1    4  X1HR  68403
4  2017      1    5  X1HR  68053

In [148]:
df_e_melt['HOUR_1'] = df_e_melt['HOUR'].str.replace('X','')
df_e_melt['HOUR_1'] = df_e_melt['HOUR_1'].str.replace('HR', '')
df_e_melt['HOUR_2'] = df_e_melt['HOUR'].str.replace('X|HR','',regex=True)
df_e_melt['HOUR_3'] = df_e_melt['HOUR'].str.replace('[^0-9]','',regex=True) #정규표현식 활성화
df_e_melt['HOUR_num'] = df_e_melt['HOUR_1'].astype('int')
df_e_melt.head()

   YEAR  MONTH  DAY  HOUR   LOAD HOUR_1 HOUR_2 HOUR_3  HOUR_num
0  2017      1    1  X1HR  60178      1      1      1         1
1  2017      1    2  X1HR  57067      1      1      1         1
2  2017      1    3  X1HR  66263      1      1      1         1
3  2017      1    4  X1HR  68403      1      1      1         1
4  2017      1    5  X1HR  68053      1      1      1         1

In [149]:
df_e_melt.pivot(index=['YEAR','MONTH','DAY'], columns ='HOUR', values='LOAD')
df_e_melt.head()

   YEAR  MONTH  DAY  HOUR   LOAD HOUR_1 HOUR_2 HOUR_3  HOUR_num
0  2017      1    1  X1HR  60178      1      1      1         1
1  2017      1    2  X1HR  57067      1      1      1         1
2  2017      1    3  X1HR  66263      1      1      1         1
3  2017      1    4  X1HR  68403      1      1      1         1
4  2017      1    5  X1HR  68053      1      1      1         1

In [151]:
df= pd.read_csv('bike.csv')
pd.concat([df.head(),df.tail()],axis = 1)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,...,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1.0,0.0,0.0,1.0,9.84,14.395,81.0,0.0,3.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2011-01-01 01:00:00,1.0,0.0,0.0,1.0,9.02,13.635,80.0,0.0,8.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,2011-01-01 02:00:00,1.0,0.0,0.0,1.0,9.02,13.635,80.0,0.0,5.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,2011-01-01 03:00:00,1.0,0.0,0.0,1.0,9.84,14.395,75.0,0.0,3.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,2011-01-01 04:00:00,1.0,0.0,0.0,1.0,9.84,14.395,75.0,0.0,0.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
10881,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,0.0,1.0,1.0,15.58,19.695,50.0,26.0027,7.0,329.0,336.0
10882,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,0.0,1.0,1.0,14.76,17.425,57.0,15.0013,10.0,231.0,241.0
10883,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,0.0,1.0,1.0,13.94,15.910,61.0,15.0013,4.0,164.0,168.0
10884,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,0.0,1.0,1.0,13.94,17.425,61.0,6.0032,12.0,117.0,129.0
10885,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,0.0,1.0,1.0,13.12,16.665,66.0,8.9981,4.0,84.0,88.0

In [153]:
pd.concat([df.head(), df.tail()],axis = 0)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count,index
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0000,3,13,16,NaN
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0000,8,32,40,NaN
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0000,5,27,32,NaN
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0000,3,10,13,NaN
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0000,0,1,1,NaN
0,2012-12-19 19:00:00,4,0,1,1,15.58,19.695,50,26.0027,7,329,336,10881.0
1,2012-12-19 20:00:00,4,0,1,1,14.76,17.425,57,15.0013,10,231,241,10882.0
2,2012-12-19 21:00:00,4,0,1,1,13.94,15.910,61,15.0013,4,164,168,10883.0
3,2012-12-19 22:00:00,4,0,1,1,13.94,17.425,61,6.0032,12,117,129,10884.0
4,2012-12-19 23:00:00,4,0,1,1,13.12,16.665,66,8.9981,4,84,88,10885.0

In [154]:
pd.concat([df.head(), df.tail().reset_index()], axis =1)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,...,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,...,0,1,1,15.58,19.695,50,26.0027,7,329,336
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,...,0,1,1,14.76,17.425,57,15.0013,10,231,241
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,...,0,1,1,13.94,15.910,61,15.0013,4,164,168
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0,3,...,0,1,1,13.94,17.425,61,6.0032,12,117,129
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0,0,...,0,1,1,13.12,16.665,66,8.9981,4,84,88

In [155]:
df.tail()

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
10881,2012-12-19 19:00:00,4,0,1,1,15.58,19.695,50,26.0027,7,329,336
10882,2012-12-19 20:00:00,4,0,1,1,14.76,17.425,57,15.0013,10,231,241
10883,2012-12-19 21:00:00,4,0,1,1,13.94,15.910,61,15.0013,4,164,168
10884,2012-12-19 22:00:00,4,0,1,1,13.94,17.425,61,6.0032,12,117,129
10885,2012-12-19 23:00:00,4,0,1,1,13.12,16.665,66,8.9981,4,84,88

In [156]:
df['datetime'] = pd.to_datetime(df['datetime'])
df['date'] = df['datetime'].dt.date
df_d1 = df.groupby('date')['temp'].max().reset_index()
df_d2 = df.groupby('date')['casual'].mean().reset_index()

In [157]:
df_d1.head()

         date   temp
0  2011-01-01  18.86
1  2011-01-02  18.86
2  2011-01-03  10.66
3  2011-01-04  12.30
4  2011-01-05  12.30

In [158]:
df_d2.head()

         date     casual
0  2011-01-01  13.791667
1  2011-01-02   5.695652
2  2011-01-03   5.454545
3  2011-01-04   4.695652
4  2011-01-05   3.565217

In [159]:
df_d_join = df_d1.merge(df_d2, on = 'date', how = 'inner')
df_d_join = df_d1.merge(df_d2, left_on = 'date', right_on = 'date', how = 'inner')
df_d_join.head()

         date   temp     casual
0  2011-01-01  18.86  13.791667
1  2011-01-02  18.86   5.695652
2  2011-01-03  10.66   5.454545
3  2011-01-04  12.30   4.695652
4  2011-01-05  12.30   3.565217

In [160]:
pd.crosstab(index = df['season'], columns = df['weather'], values = df['casual'], 
            aggfunc = lambda x : round(x.mean(), 2) + 3000)

weather        1        2        3       4
season
1        3017.65  3013.72  3003.53  3006.0
2        3053.13  3041.49  3020.59     NaN
3        3054.97  3049.78  3032.92     NaN
4        3033.53  3022.29  3013.67     NaN

In [161]:
ser = pd.Series(['123','2','lot_123','2_a_4b'])
ser

0        123
1          2
2    lot_123
3     2_a_4b
dtype: object

In [162]:
ser[ser.str.contains("[0-9]{2,}")]

0        123
2    lot_123
dtype: object

In [163]:
ser_m = pd.Series(['123원','1.234$','34.45$','-234'])
ser_m

0      123원
1    1.234$
2    34.45$
3      -234
dtype: object

In [165]:
ser_m.str.replace("원|$|.", repl="", regex=True)

0
1
2
3
dtype: object

In [167]:
ser_m.str.replace("원|\$|.", repl="", regex=True)

0
1
2
3
dtype: object

In [168]:
ser_m.str.replace("[^0-9]", repl="", regex=True)

0     123
1    1234
2    3445
3     234
dtype: object

In [169]:
ser_m.str.replace("[^0-9].", repl="", regex=True)

0    123원
1    134$
2    345$
3      34
dtype: object

In [170]:
ser_m.str.replace("[^0-9.-]", repl="", regex=True)

0      123
1    1.234
2    34.45
3     -234
dtype: object